Revit 2024 API
OptionalFunctionalityUtils Class
 A collection of utilities that can be used to determine if a particular set of functionality is installed and available.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class OptionalFunctionalityUtils
Visual Basic
Public NotInheritable Class OptionalFunctionalityUtils
Visual C++
public ref class OptionalFunctionalityUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.OptionalFunctionalityUtils
See Also
OptionalFunctionalityUtils Members
Autodesk.Revit.DB Namespace